{
  "THEME":{
    "DARK":"Dark",
    "LIGHT":"Light"
  },
  "LANGUAGE":{
    "ZH_HANS":"简体中文",
    "ZH_HANT":"繁體中文",
    "EN_US":"English"
  },
  "BASE": {
    "INDEX":"Index",
    "WELCOME": "Welcome",
    "LANGUAGE":"Language",
    "THEME":"Theme",
    "ABOUT":"About",
    "ABOUT_WEBSITE":"About Website",
    "NAME":"Yunze Liu",
    "FROM":"Urumqi XJ",
    "FROM_NOW":"From Now",
    "JOB":"Front-End ENG",
    "ALBUM":"Album",
    "RESUME":"Resume",
    "INTRODUCTION":"Introduction",
    "WANT_TO_SAY":"I want to say",
    "MUSIC":"Music",
    "MOVIE":"Movie",
    "BOOK":"Book",
    "MOVIE_TITLE1": "Kingdom of Heaven",
    "MOVIE_INFO1": "United Kingdom Germany Spain Morocco United States Italy France/Drama History War/Released on 2005-05-06 (USA)",
    "MOVIE_DES1": "In France in the twelfth century, a young blacksmith, Balian, accidentally knew that he was the long-lost illegitimate son of the Crusader general Godfrey. Balian follows his father to Jerusalem in search of redemption. With his bravery, proficiency in battle and noble character, Balian was not only highly appreciated by the king, but also the beautiful princess Sibella secretly admired him. The king of Jerusalem died, and a new king succeeded to the throne. The warlike new king started a war, and Saladin led the Saracen knights to regain their holy land, Jerusalem. In times of crisis, Balian stepped forward and vowed to defend the Kingdom of Heaven",
    "MOVIE_WORDS1": "This is one of my favorite movies. It’s really beautiful. The epic soundtrack is immersive. It made me very interested in the religion and history of Europe hundreds of years ago.",
    "BOOK__TITLE1": "Three Body",
    "BOOK__INFO1": "Liu Cixin/Chongqing Publishing House/Science Fiction World/2008-January Published",
    "BOOK_DES1": "The book tells the story of the survival battle between human civilization and the Trisolaran civilization that plans to colonize the earth after it first screamed into the universe at the Red Bank Base. 'The Three-Body Problem' is not only a literary work, but also an excellent science fiction work. This work creates an extremely majestic science fiction world, guides readers to know and understand the scientific world from another perspective, inspires readers' yearning for the vast starry sky, and keeps people curious and actively exploring the mysteries of the universe.",
    "BOOK_WORDS1": "I have been thinking about it for a long time and don’t know how to evaluate this book. I still remember my obsession with this book. After reading this book, I was so shocked that I got goosebumps all over my body. I didn’t recover for a long time and just wanted to think quietly. What is the meaning of my existence in this world? Human beings are so insignificant, and I am just an ant among the vast stars. I have never read a book that shocked me so much before.",
    "LAB":"Laboratory",
    "SHARE":"Share",
    "PER_PAGE":"Home page",
    "PROJECT":"Project",
    "TO_BE_DEVELOPED":"To be developed",
    "INTRODUCE":"Introduction",
    "MAIN_PROFESSIONAL_SKILL":"Main professional skill",
    "DEV_TOOLS":"Development tools",
    "WEBSET_RUNNING":"has been running",
    "ADRESS":"ChengDu SC"
  },
  "TEXT":{
    "PER_PAGE_TEXT":"Introduction, Photo album, Tags, etc.",
    "RESUME_TEXT":"Personal resume",
    "PROJECT_TEXT":"Already completed project",
    "SHARE_TEXT":"Share some music, movies, games and other things worth sharing",
    "ABOUT_TEXT":"Some introductions and experiences about the website",
    "LAB_TEXT":"Some small things that are still under development or have completed hand training",
    "TO_BE_DEVELOPED_TEXT":"Features to be developed",
    "INTRODUCE_TEXT":"I come from 'the most center of the Eurasian continent' and 'the city farthest from the ocean in the world'-Urumqi, located at the northern foot of the middle section of the Tianshan Mountains and adjacent to Central Asian countries. It is Xinjiang’s politics, culture, science, education, and transportation center.There are no yurts or thousands of sheep. What I like most is all the food made of our Xinjiang mutton (and the Cantonese morning tea), undergraduate major: software engineering. The favorite multiplayer sport is playing ball. My favorite single player sport is coding. I also like to play dark-realistic FPS games with my friends, such as hardcore games like Escape Takov, but they can often be played as funny games. I want to be a funny game anchor and dream of being able to collaborate with others to develop some ideas in the future. Sexual product entrepreneurship."
  },
  "ABOUT": {
    "TECHNOLOGY": "Technology",
    "TECHNOLOGY_DES": "Construction，technologies used,etc.",
    "TECHNOLOGY_TEXT": "The website was built using GitHub Pages. The framework of the website uses Angular10. This homepage is intended to be used to familiarize yourself with the Angular framework and practice style development. I also used Angular's official component library material and the third-party Swiper component library",
    "DESIGN": "Design",
    "DESIGN_DES": "Design style and ideas",
    "DESIGN_TEXT": "Before making this website, I saw their own homepages made by other programmers on the Internet, but they were very ordinary. I also happened to see some renderings of CSS3 frosted glass on the Internet, so I suddenly wanted to develop an H5 homepage. This website mainly uses the frosted glass effect as the main body, with white and purple as the base tone. Use shadow styles to create buttons, suspension and other effects. The click effect of the homepage navigation bar and the upper right TabBar option uses the ripple effect in the material library. The homepage banner page uses the Swiper component library, and the card is designed in the Instagram style. Expand the panel to practice the style, all handwritten. The website also makes extensive use of animation transfrom animations.",
    "COMPATIBILITY": "Compatibility",
    "COMPATIBILITY_DES": "Adaptation to various devices",
    "COMPATIBILITY_TEXT": "The main page style of this site uses Flex flexible box layout, and the CSS style units are mostly vh and percentage. Therefore, the compatibility on most devices is good, but the only reference device developed is the Apple mobile phone, and as personal technology continues to improve, compatibility is still the first goal that this site needs to improve.",
    "FUNCTION": "Functions",
    "FUNCTION_DES": "Functions and some details",
    "FUNCTION_TEXT": "The purpose of this site is to be simple and reusable, so all lists are written using loop syntax and are not hard-coded in a fixed style. It improves the convenience of later maintenance. This site has also added multi-language functionality. The menu bar at the top of the homepage and the small rocket (return to top function) in the lower right corner are independent components. The contact information below the card at the top of the homepage is a clickable button. Clicking another button will automatically close the previously clicked button. Data is injected into the cookie of the home page, so when you enter it for the first time, there will be an upward icon prompt. When you click to like or comment, a pop-up box will prompt that this website currently does not have a backend, so you cannot like and comment. The skill card below slides down and then pops up with animation. The music sharing on the sharing page has H5 music playback function. The About Website page has a countdown function to date since website development. I won’t go into details about the functions, there are more functions yet to be developed.",
    "PRODUCTION": "Production",
    "PRODUCTION_DES": "things in the making process",
    "PRODUCTION_TEXT": "I would like to thank my colleagues Zhong Jialiang and Guo Yueteng for their help during my development process and solving many difficult and complicated diseases with me. Thank you very much!",
    "DAY":"D",
    "HOUR":"H",
    "MIN":"M",
    "SEC":"S"
  }
}
